[
  "sliding-panes-obsidian",
  "obsidian-admonition",
  "templater-obsidian",
  "obsidian-languagetool-plugin",
  "table-editor-obsidian",
  "obsidian-spaced-repetition",
  "settings-search",
  "cmdr",
  "recent-files-obsidian",
  "url-into-selection",
  "dataview",
  "obsidian-book-search-plugin",
  "quickadd",
  "obsidian-projects",
  "obsidian-full-calendar",
  "obsidian-textgenerator-plugin",
  "obsidian-plugin-update-tracker",
  "note-refactor-obsidian",
  "obsidian-plugin-toc",
  "janitor",
  "obsidian-banners",
  "obsidian-style-settings",
  "nldates-obsidian",
  "emoji-shortcodes",
  "cm-editor-syntax-highlight-obsidian",
  "better-word-count",
  "dbfolder"
]